OpenFOAM/montana-v2106/run/rhoCentralFoam/shockTube/0_orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 2.04e-3;

boundaryField
{
left
    {
     //   type            cyclic;
	type            zeroGradient;
    }
    right
    {
      //  type            cyclic;
	type            zeroGradient;
    }
    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
