OpenFOAM/montana-v2106/run/rhoCentralFoam/shockTube/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 1; 

boundaryField
{
    left
    {
     //   type            cyclic;
	type            zeroGradient;
    }
    right
    {
      //  type            cyclic;
	type            zeroGradient;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
