OpenFOAM/montana-v2106/run/rhoCentralFoam/shockTube/0_orig/pB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    left
    {
       // type            cyclic;
	type		fixedValue;
	value		uniform 	0;
    }
    right
    {
       // type            cyclic;
	type		fixedValue;
	value		uniform 	0;
    }
    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
