OpenFOAM/montana-v2106/run/rhoCentralFoam/shockTube/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-09;
        relTol          0.01;
    }

    h
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }
    pB
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.05;
        smoother        symGaussSeidel;
        nCellsInCoarsestLevel 200;
    }

    pBFinal
    {
        $pB;
        relTol          0;
    }

    B
    {
      /*  solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;*/
	solver          GAMG;
        smoother        DILU;
        tolerance       1e-9;
        relTol          0.01;
	maxIter		1000;
    }
}


// ************************************************************************* //
